ada_2_hl7/mp/9.0.7/sturen_medicatievoorschrift/POC/Tranche-1/test_vzvz/store_B91C6ED6-73D2-11E8-BD1F-0050560F0714.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <MCCI_IN000002 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <id root="2.16.840.1.113883.2.4.3.39.6101.90000381.90000082.1" extension="34252"/>
      <creationTime value="20180619170911.7897+0200"/>
      <versionCode code="NICTIZEd2005-Okt"/>
      <interactionId root="2.16.840.1.113883.1.6" extension="MCCI_IN000002"/>
      <profileId root="2.16.840.1.113883.2.4.3.11.1" extension="810"/>
      <processingCode code="P"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <acknowledgement typeCode="CE">
        <acknowledgementDetail typeCode="E">
          <code code="KEY205" codeSystem="2.16.840.1.113883.5.1100"/>
          <text>Message contains one or more prescriptions that have already been received.</text>
        </acknowledgementDetail>
        <targetMessage>
          <id root="2.16.840.1.113883.2.4.6.6.1043251.1.1" extension="6"/>
        </targetMessage>
      </acknowledgement>
      <receiver>
        <device>
          <id root="2.16.840.1.113883.2.4.6.6" extension="1"/>
          <name>Landelijk schakelpunt</name>
        </device>
      </receiver>
      <sender>
        <device>
          <id root="2.16.840.1.113883.2.4.6.6" extension="90000082"/>
          <softwareName>Mira</softwareName>
          <agencyFor>
            <representedOrganization>
              <id root="2.16.528.1.1007.3.3" extension="90000381"/>
              <name>Mira Apotheekhoudend (Srvlspmira2)</name>
              <telecom value="x-hl7-applicatie:2.16.840.1.113883.2.4.6.6.90000082"/>
            </representedOrganization>
          </agencyFor>
        </device>
      </sender>
    </MCCI_IN000002>
  </s:Body>
</s:Envelope>
